thanks for your responses. appreciate it !.

here is modified code : 

```
provider "vcd" {
  user                 = ""
  password             = ""
  token                = "b1e6c2080ddf484cbfaae25e086116be"
  org                  = "ID4250-Sent"
  vdc                  = "ID4250-Sent"
  url                  = "https://nl9u102.abc.com/api"
  max_retry_timeout    = "30"
  allow_unverified_ssl = "true"
}

resource "vcd_vapp" "web" {
  name = "web"
  power_on = "true"
}

data "vcd_vapp" "web" {
  name             = "web"
  org              = "ID4250-Sent"
}

data "vcd_catalog" "my-cat" {
  org  = "ID4250-Sent"
  name = "ID14250_ISO"
}
resource "vcd_vapp_vm" "web1" {
  vapp_name     = data.vcd_vapp.web.name
  name          = var.vmname
  catalog_name  = "ID14250_ISO"
  template_name = ""
  memory        = 2048
  cpus          = 2
  cpu_cores     = 1
}

```

**here is the output of command : terraform apply** 

> root@jen:~/terraform# terraform apply
> data.vcd_vapp.web: Refreshing state...
> data.vcd_catalog.my-cat: Refreshing state...
> vcd_vapp.web: Refreshing state... [id=urn:vcloud:vapp:451de414-04c9-44e1-a3e6-185b6ef34466]
> 
> An execution plan has been generated and is shown below.
> Resource actions are indicated with the following symbols:
>   + create
> 
> Terraform will perform the following actions:
> 
>   # vcd_vapp_vm.web1 will be created
>   + resource "vcd_vapp_vm" "web1" {
>       + accept_all_eulas               = true
>       + catalog_name                   = "ID14250_ISO"
>       + computer_name                  = (known after apply)
>       + cpu_cores                      = 1
>       + cpus                           = 2
>       + description                    = (known after apply)
>       + expose_hardware_virtualization = false
>       + href                           = (known after apply)
>       + id                             = (known after apply)
>       + ip                             = (known after apply)
>       + mac                            = (known after apply)
>       + memory                         = 2048
>       + name                           = "web1"
>       + power_on                       = true
>       + storage_profile                = (known after apply)
>       + vapp_name                      = "web"
>     }
> 
> Plan: 1 to add, 0 to change, 0 to destroy.
> 
> Do you want to perform these actions?
>   Terraform will perform the actions described above.
>   Only 'yes' will be accepted to approve.
> 
>   Enter a value: yes
> 
> vcd_vapp_vm.web1: Creating...
> 
> Error: error finding catalog item: [ENF] entity not found
> 
>   on main.tf line 28, in resource "vcd_vapp_vm" "web1":
>   28: resource "vcd_vapp_vm" "web1" {
> 

**things which are there in my VCD.  (i double checked)**

1: ORG and VDC names are same.
2: catalog is not empty , if you see the above code, i have mentioned now correct catalog name. I am still not sure what is mean by catalog item ??
3: the catalog name which i am using above , does not have any VApp template. VApp template is mandatory ? , if yes, i have to create one ? is there any workaround to bypass vapp template and directly access media using catalog ? 

Pls suggest. Thanks.

 